{"class_name": "Sequential", "keras_version": "2.0.8", "backend": "tensorflow", "config": [{"class_name": "LSTM", "config": {"stateful": false, "recurrent_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "unroll": false, "kernel_constraint": null, "bias_regularizer": null, "name": "lstm_1", "activity_regularizer": null, "return_sequences": true, "go_backwards": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "return_state": false, "recurrent_regularizer": null, "recurrent_dropout": 0.0, "batch_input_shape": [null, 60, 1], "activation": "tanh", "dtype": "float32", "implementation": 0, "use_bias": true, "dropout": 0.0, "bias_constraint": null, "unit_forget_bias": true, "recurrent_activation": "hard_sigmoid", "trainable": true, "units": 50, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "kernel_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.2, "name": "dropout_1"}}, {"class_name": "LSTM", "config": {"bias_constraint": null, "stateful": false, "recurrent_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "unroll": false, "kernel_constraint": null, "bias_regularizer": null, "name": "lstm_2", "activity_regularizer": null, "go_backwards": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "return_state": false, "recurrent_regularizer": null, "recurrent_dropout": 0.0, "return_sequences": true, "activation": "tanh", "implementation": 0, "use_bias": true, "dropout": 0.0, "trainable": true, "unit_forget_bias": true, "recurrent_activation": "hard_sigmoid", "units": 50, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "kernel_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.2, "name": "dropout_2"}}, {"class_name": "LSTM", "config": {"bias_constraint": null, "stateful": false, "recurrent_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "unroll": false, "kernel_constraint": null, "bias_regularizer": null, "name": "lstm_3", "activity_regularizer": null, "go_backwards": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "return_state": false, "recurrent_regularizer": null, "recurrent_dropout": 0.0, "return_sequences": true, "activation": "tanh", "implementation": 0, "use_bias": true, "dropout": 0.0, "trainable": true, "unit_forget_bias": true, "recurrent_activation": "hard_sigmoid", "units": 50, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "kernel_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.2, "name": "dropout_3"}}, {"class_name": "LSTM", "config": {"bias_constraint": null, "stateful": false, "recurrent_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "unroll": false, "kernel_constraint": null, "bias_regularizer": null, "name": "lstm_4", "activity_regularizer": null, "go_backwards": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "return_state": false, "recurrent_regularizer": null, "recurrent_dropout": 0.0, "return_sequences": false, "activation": "tanh", "implementation": 0, "use_bias": true, "dropout": 0.0, "trainable": true, "unit_forget_bias": true, "recurrent_activation": "hard_sigmoid", "units": 50, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "kernel_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.2, "name": "dropout_4"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "name": "dense_1", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_regularizer": null, "units": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "bias_constraint": null, "activation": "linear"}}]}