{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.8", "config": [{"class_name": "Conv2D", "config": {"dtype": "float32", "padding": "valid", "kernel_size": [3, 3], "batch_input_shape": [null, 64, 64, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "conv2d_1", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "use_bias": true, "filters": 32, "strides": [1, 1], "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_1", "trainable": true, "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"padding": "valid", "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "conv2d_2", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "activity_regularizer": null, "use_bias": true, "filters": 32, "strides": [1, 1], "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_2", "trainable": true, "strides": [2, 2]}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "dense_1", "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "units": 128, "activation": "relu"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "dense_2", "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "units": 1, "activation": "sigmoid"}}]}